{
  "palace_traits": {
    "命宮": {
      "high_score": "目前核心磁場強大，個人意志與執行力處於巔峰，是開創全局、展現自我的最佳時機。",
      "low_score": "當前能量處於重整階段，容易產生精神內耗或目標模糊，建議採取「靜觀其變」的策略，不宜強出頭。",
      "triple_taboo": "正值歲運併臨的劇烈震盪期，能量極度不穩，凡事切莫強求，務必保守待時以避開正面衝擊。",
      "clash": "命宮遭遇祿忌對沖，自我認同與外界期待產生矛盾，情緒起伏如波濤，宜修煉內核穩定度。",
      "market_tag": "核心能量場"
    },
    "兄弟宮": {
      "high_score": "手足與同僚間的能量流動和諧，能獲得實質的人際助力，是擴大共識與合作的良機。",
      "low_score": "與平輩間的溝通存在雜訊，容易因認知差異產生誤解，近期不宜進行大額資金往來或深度的事業結盟。",
      "triple_taboo": "平輩關係面臨嚴峻考驗，易有劇烈競爭或因利害衝突導致失和，建議暫時保持安全社交距離。",
      "clash": "祿忌糾纏於兄弟位，情義與利益邊界模糊，需防範「知人知面不知心」的潛在風險。",
      "market_tag": "人際支持力"
    },
    "夫妻宮": {
      "high_score": "感情場域能量甜美，與配偶或親密夥伴共感力增強，適合深層交流或共謀長遠計畫。",
      "low_score": "情感生活陷入沈悶或各執一詞的僵局，需以包容與耐心緩解隔閡，避免在情緒低點做決定。",
      "triple_taboo": "情感關係面臨劇烈震盪，潛藏的隱憂可能全面爆發，需嚴防信任危機或不可控的意外爭端。",
      "clash": "夫妻宮祿忌相沖，愛恨情緒交織，溝通易演變為口舌是非，情緒化言論對關係傷害極深。",
      "market_tag": "姻緣穩定度"
    },
    "子女宮": {
      "high_score": "晚輩、子女或下屬動能旺盛，互動中能激發靈感，計畫推行充滿活力與創造力。",
      "low_score": "與晚輩間的溝通出現代溝，指令傳達易產生偏誤，需以柔性引導取代剛性壓制。",
      "triple_taboo": "子女或下屬事務繁雜多變且帶有負面連動，易因疏忽造成損失，凡事宜高度謹慎。",
      "clash": "計畫執行易生變數，晚輩行為反覆無常，應建立完善的風險備案，避免因依賴產生被動。",
      "market_tag": "傳承影響力"
    },
    "財帛宮": {
      "high_score": "財氣匯聚，正財運勢穩步看漲，財務規劃的執行效率極高，有利於價值變現。",
      "low_score": "財星受制，開支容易超出預算軌道，需嚴格控管現金流，警惕表面光鮮的財務陷阱。",
      "triple_taboo": "財務黑洞隱現，能量發生嚴重失衡，此時絕不宜進行任何形式的投機性投資或借貸。",
      "clash": "財帛宮出現祿忌對沖，呈現「先得後破」之象，財務進出頻繁且不穩定，需謹慎理財。",
      "market_tag": "進財壓力值"
    },
    "疾厄宮": {
      "high_score": "身心生理狀態處於高位穩定，體能恢復與代謝機能良好，適合啟動高強度的養生或運動計畫。",
      "low_score": "體力消耗速率過快，需提防積勞成疾的風險，舊有疾症易在能量低點出現反覆跡象。",
      "triple_taboo": "健康預警訊號強烈，身心負荷已達臨界點，務必優先保障睡眠與休息，嚴防突發性疾病。",
      "clash": "祿忌引動生理反應，情緒起伏直接衝擊自律神經系統，宜結合心理調適來緩解生理不適。",
      "market_tag": "身心平衡度"
    },
    "遷移宮": {
      "high_score": "外務環境運勢強勁，社交磁場廣闊，出外易獲貴人提攜，是向外拓展與跨界發展的黃金期。",
      "low_score": "外部環境阻礙增多，出門在外易遭遇小人掣肘，行動宜保持低調，減少非必要的社交支出。",
      "triple_taboo": "外在場域險峻，易生意外爭端或不可預見的阻礙，近期不宜遠行或進行重大的現狀變動。",
      "clash": "社交關係虛實參半，出門在外變數極多，關鍵場合宜謹言慎行，避免因誤會造成名譽損害。",
      "market_tag": "機遇拓展力"
    },
    "交友宮": {
      "high_score": "人脈資源極其活絡，群眾助力感強烈，適合進行團隊整合、資源交換或大規模的社交活動。",
      "low_score": "朋友圈或部屬提供的助力有限，甚至可能產生負面損耗，不宜過度依賴他人的承諾。",
      "triple_taboo": "社交圈面臨斷捨離與劇烈洗牌，易受友人牽連或背叛，在合作中務必保留核心底牌。",
      "clash": "交友宮祿忌糾葛，利害關係錯綜複雜，需保持清醒的觀察力，嚴防「損友」對運勢的拖累。",
      "market_tag": "眾生助力值"
    },
    "官祿宮": {
      "high_score": "事業運勢步入坦途，職場權威感與貴人運同步提升，適合承接高難度任務或挑戰職位晉升。",
      "low_score": "職場壓力指數顯著攀升，容易遭遇溝通斷層或進度延宕，需耐性協調資源，切忌急功近利。",
      "triple_taboo": "事業面臨關鍵的存亡轉型或重重關卡，能量阻塞嚴重，此時不宜大規模擴張或草率轉職。",
      "clash": "職場是非紛擾不斷，成就易受外力質疑或挪用，建議厚植實力，以防禦姿態守護成果。",
      "market_tag": "職場競爭力"
    },
    "田宅宮": {
      "high_score": "家宅能量磁場極佳，家運昌隆且利於資產保值，適合進行環境整頓、裝修或房產相關決策。",
      "low_score": "家中瑣事紛雜，居住環境易出現維護需求，需投入額外心力維繫家庭關係的和諧。",
      "triple_taboo": "家宅能量極度不穩，易發生家運震盪或重大資產糾紛，應暫緩任何重大的不動產交易。",
      "clash": "家庭內部意見嚴重分歧，財富守成難度增加，宜先處理內部矛盾，穩定家庭核心基石。",
      "market_tag": "家產守護感"
    },
    "福德宮": {
      "high_score": "內心平靜且靈魂能量充足，精神世界享受豐富，適合進行深度思考、心靈成長或長期規劃。",
      "low_score": "精神內耗明顯，情緒容易陷入負面循環，建議放慢生活節奏，透過靜坐或閱讀尋求內在寧靜。",
      "triple_taboo": "精神壓力指標達危險等級，易生極端情緒或嚴重失眠，必須高度重視身心平衡與解壓。",
      "clash": "理想與現實之間的拉扯感極強，精神焦慮感加劇，宜降低期待值，專注於當下的自我修復。",
      "market_tag": "精神豐盈度"
    },
    "父母宮": {
      "high_score": "能獲得長輩、上司或威權階層的實質提攜，文書與官考運勢極佳，人脈橋樑暢通無阻。",
      "low_score": "與長輩或權威者的溝通易生隔閡，文書往來需精細校對，防範因行政疏漏引發的不便。",
      "triple_taboo": "與權威層級、法律文書相關的事務面臨嚴峻考驗，易有官非或行政阻礙，凡事須依法依規。",
      "clash": "父母宮祿忌相見，與上司或長輩的關係忽冷忽熱，合約協議中需嚴防隱藏的利益陷阱。",
      "market_tag": "蔭庇支持力"
    }
  },
  "star_advice": {
    "紫微": "在展現領導威信的同時，務必兼顧民主溝通，傾聽基層意見能讓你的決策更具厚度。",
    "天機": "思緒敏捷是優勢，但應防範陷入過度計算的泥淖，建議設定期限後立即執行，轉空想為實做。",
    "太陽": "目前光芒四射但也容易灼傷他人，待人處事宜保持適度的謙遜，溫和的態度能化解口舌之災。",
    "武曲": "性格剛毅、執行力極強，但需留意對身邊人的管理語氣是否過於強硬，彈性的合作更持久。",
    "天同": "心境平穩適合調劑身心，但需警惕安於現狀的舒適圈，適度的危機感能激發你的潛能。",
    "廉貞": "心思敏銳且富具創意，但需嚴格控管情緒波動，減少不必要的社交應酬以避開是非干擾。",
    "天府": "格局穩健具備守成智慧，適合資產配置與管理，但需留意莫因過於保守而錯失市場轉機。",
    "太陰": "感性思維細膩，適合進行長遠的幕後規劃，應避免受情緒波動主導決策，理性才是你的防線。",
    "貪狼": "近期交際頻繁、誘惑增多，需建立規律的作息節奏，避免在物質享受中損耗核心能量。",
    "巨門": "才華顯露於言辭之間，但需防範「言多必失」的後果，將精力聚焦於專業技術的磨練更具價值。",
    "天相": "天生具備優秀的協調感，適合擔任幕僚或中間人，但在關鍵決策上需堅持原則，以免淪為優柔寡斷。",
    "天梁": "老成持重，適合處理糾紛或傳承經驗，但需注意莫讓先入為主的觀念阻礙了新知識的吸收。",
    "七殺": "正值衝勁十足的變革期，適合開疆闢土，但務必設定停損點，避免因一時衝動造成連鎖性誤事。",
    "破軍": "變動能量極大，具備破舊立新的勇氣，但在執行過程中需精算成本，防範耗損過大而後繼無力。",
    "左輔": "近期有貴人主動提攜，做事能收事半功倍之效，建議主動尋求跨部門或團隊式的協作。",
    "右弼": "暗中有隱形助力加持，適合進行私下的資源整合，良好的人際關係是你目前最有價值的資產。",
    "文昌": "利於各類文書、證照、考試與學術研究，專注處理文字細節能為你贏得卓越的專業聲望。",
    "文曲": "直覺與靈感正值高峰，利於藝術創作、行銷創意或口語表達，適合展示個人軟實力與獨特性。",
    "天魁": "具備顯性的貴人運勢，遇到困難時多向長輩或權威者請益，往往能獲得意想不到的解方。",
    "天鉞": "暗藏深層的發展機遇，適合在幕後進行策略規劃，成功的機會往往隱藏在不易察覺的細節處。",
    "祿存": "這是你的財富與能量保護傘，適合採取穩健理財策略，能在外界環境波動中維持核心實力。",
    "擎羊": "能量衝擊力極強，應將此爆發力轉化為攻堅克難的執行力，嚴防受傷與對抗性的口舌爭端。",
    "陀羅": "事務進展容易陷入膠著或反覆，需具備長期抗戰的心理建設，此時「慢工出細活」優於急躁求成。",
    "火星": "爆發力驚人但續航力稍欠，務必管控瞬間噴發的情緒，防範突發性變數與人際衝突帶來的損害。",
    "鈴星": "內心存在隱而不顯的壓力，需高度關注心理韌性，避免因長期壓抑而導致健康或決策的崩潰。",
    "地空": "思維天馬行空、不受傳統框架約束，雖利於創意發想，但在具體執行面需補足邏輯與數據支撐。",
    "地劫": "容易發生預算超支或計畫被外力干擾，建議減少高風險的財務博弈，回歸腳踏實地的營運模式。",
    "天馬": "變動、遷移與外出的機會增多，適合向外開拓市場，在移動與動能中獲取財富與新視野。",
    "紅鸞": "情感磁場活躍，社交人緣極佳，單身者有利於拓展姻緣，已有伴侶者宜保持界線、嚴防誘惑。",
    "天喜": "生活中將迎來愉悅的驚喜，社交活動頻繁，利於建立正向的人際連結與慶祝活動。"
  },
  "interaction_traits": {
    "couple": {
      "祿": "對方是你生命中的貴人，相處過程中充滿情意交流與實質的成長助力。",
      "權": "對方在關係中展現較強的管教或主導欲望，決策權往往偏向另一方。",
      "科": "雙方相處溫文儒雅，重視精神層面的交流與外在體面的維繫。",
      "忌": "你容易為對方過度操心，或對方帶給你較大的精神束縛與無形壓力。"
    },
    "parent_child": {
      "祿": "兩代之間疼愛有加，家庭資源傳承管道順暢，互動親密且充滿情感支持。",
      "權": "家教模式較為嚴厲，兩代間存在明確的尊卑界線，或晚輩展現出強烈的自主領導能力。",
      "科": "親子互動如朋友般知性，重視言傳身教與品德培養，氣氛和諧且具備人文涵養。",
      "忌": "管教模式較為糾結或容易產生代溝，長輩對晚輩的擔憂往往演變成不必要的心理負擔。"
    },
    "family": {
      "祿": "家宅磁場具備生旺效果，家庭是你運勢中最堅實的盾牌，且利於資產守成。",
      "權": "家庭成員中存在具備威權感的領導核心，家族事務上有嚴格的規範與運作秩序。",
      "科": "家宅能量清雅，重視門風與教養，成員間的互動斯文有序且注重外界形象。",
      "忌": "家宅事務繁雜勞心，家長制或家庭責任讓你感到沈重壓力，需注意空間環境的排壓。"
    }
  },
  "risk_levels": {
    "0": "目前的運勢路徑平安無事，適合維持規律且高品質的生活節奏。",
    "20": "環境中存在輕微雜音，但不足以影響大局，保持平常心即可。",
    "40": "運勢略有波動，細節處理上需多花心思，注意微小徵兆的警示。",
    "60": "外部壓力持續攀升，建議將責任分擔，避免單打獨鬥以降低風險。",
    "70": "風險訊號顯著，目前非變動良機，任何重大決策建議延後進行。",
    "90": "正值極高風險期，請立即啟動避險機制，以保守防禦為最高行動準則。"
  },
  "intensity_tags": {
    "high": "能量鼎盛",
    "medium": "能量持平",
    "low": "能量低迷",
    "warning": "極度不穩"
  }
}
